let booksData = [
  {
    book: {
      description:
        "Сборник представляет разные грани творчества знаменитого «черного юмориста». Американец ирландского происхождения, Данливи прославился в равной степени откровенностью интимного содержания и проникновенностью, психологической достоверностью даже самых экзотических ситуаций и персоналий. Это вакханалия юмора, подчас черного, эроса, подчас шокирующего, остроумия, подчас феерического, и лирики, подчас самой пронзительной. ",
      cover:
        "https://i.livelib.ru/boocover/1000089210/o/3ecb/Dzhejms_Patrik_Danlivi__Samyj_sumrachnyj_sezon_Semyuelya_S_sbornik.jpeg",
      title: "Самый сумрачный сезон Сэмюэля С.",
      isbn: "5-352-00963-7"
    },
    authors: [
      {
        avatar:
          "https://j.livelib.ru/auface/103113/140x140/bff9/Dzhejms_Patrik_Danlivi.jpg",
        name: "Джеймс Патрик Данливи"
      }
    ],
    routes: [
      {
        name: "Main Points",
        path: [
          {
            name: "Прогулки верхом в Пратере",
            description:
              "1. Через двадцать минут у него была новая хозяйка. Он явился к ней прямо с вокзала. Вдова, аристократка, длинный нос, давно уже не живет в лучшей части города. Он поклонился, она улыбнулась. У нее были волосы, грудь, ноги - все как полагается. Так что они прекрасно устроили друг друга как хозяйка и жилец. Тогда же начался краткий период конных свиданий с Графиней: прогулки верхом в Пратере. Как-то раз она остановила свою лошадь под деревом - ее белокурые волосы развевались на ветру - и сказала: - Герр С., у вас есть одна поразительная черта: вы никогда не кичитесь своими манерами.\n2. А на третий намекнул, что толстой Кэтрин не мешало бы растрясти жир - покататься верхом в Пратере. Абигайль сказала, что он слишком много себе позволяет и какой же он после этого американец. - А какие бывают. - Понятия не имею. Но вы не похожи на тех американцев, которых я знаю.",
            lat: "48.216739",
            lon: "16.398028",
            order: "1"
          },
          {
            name: "Императорский склеп",
            description:
              '1. Долго слонялся по Вене, этому огромному перекрестку кровей. Все очень хорошо перемешаны. Нет только ирландской. Зашел взглянуть на "Сердца Габсбургов". Мое при этом даже не дрогнуло. Распрямив плечи, двинулся дальше. Пока не сдали нервы - я заплакал. 2. Следующие четыре дня Сэмюэл С., обливаясь потом, вел стоическую нервную борьбу. Тигренок выскочил из кровати, через всю комнату бросился к раковине и подставил под сильную ледяную струю свою мордочку, чтобы продрать склеенные сном глазенки. Одна иконоборческая выходка: впервые за пять лет он не явился на встречу с герром Доктором. У Абигайль были длинные волосы и ослепительно чистые белки глаз, отороченные шелком длинных ресниц. В первый день он повел обеих смотреть "Сердца Габсбургов".',
            lat: "48.205731",
            lon: "16.370027",
            order: "2"
          },
          {
            name: "Улица Зингерштрассе",
            description:
              "Сэмюэл С. пересек Зингерштрассе, сразу - за угол, а там - в прохладную тенистую аллею. Порой можно оставаться в живых, просто запечатлев свой образ в мозгу знакомых.",
            lat: "48.207062",
            lon: "16.374309",
            order: "3"
          },
          {
            name: "Рынок Нашмаркт",
            description:
              "Понедельник, прохлада, чистое небо, сияние солнца. Воспоминание о том, как он прижимается к ее маленькому крепкому заду. Сэмюэл С. принимал ванну: теплые воды омывали грудь, лизали мочки ушей. После того как рана была тщательно промыта и обработана, он взял курс на восток. Сделал три мили вниз по течению реки Вена - едва различимая, она бежала по бетонному руслу и исчезала под Нашмаркт. Проследовал мимо Оперы, по запруженной толпой Кернтнерштрассе. Заказал чашку кофе и рогалик в том самом кафе, где он познакомился с Абигайль. В три часа он позвонил Графине. Она сообщила, что слишком измучена и издергана для очной ставки. Сэмюэл С. сказал, что он может перезвонить в это же самое время. В будущем году. Церковный колокол пробил четыре, он сел в 71-й трамвай, который закружил по улицам, названным в честь философов.",
            lat: "48.198826",
            lon: "16.363429",
            order: "4"
          },
          {
            name: "Венская государственная опера",
            description:
              "Понедельник, прохлада, чистое небо, сияние солнца. Воспоминание о том, как он прижимается к ее маленькому крепкому заду. Сэмюэл С. принимал ванну: теплые воды омывали грудь, лизали мочки ушей. После того как рана была тщательно промыта и обработана, он взял курс на восток. Сделал три мили вниз по течению реки Вена - едва различимая, она бежала по бетонному руслу и исчезала под Нашмаркт. Проследовал мимо Оперы, по запруженной толпой Кернтнерштрассе. Заказал чашку кофе и рогалик в том самом кафе, где он познакомился с Абигайль. В три часа он позвонил Графине. Она сообщила, что слишком измучена и издергана для очной ставки. Сэмюэл С. сказал, что он может перезвонить в это же самое время. В будущем году. Церковный колокол пробил четыре, он сел в 71-й трамвай, который закружил по улицам, названным в честь философов.",
            lat: "48.203284",
            lon: "16.369156",
            order: "5"
          },
          {
            name: "??? Кафе, где Сэмюэль познакомился с Абигайль",
            description:
              "Понедельник, прохлада, чистое небо, сияние солнца. Воспоминание о том, как он прижимается к ее маленькому крепкому заду. Сэмюэл С. принимал ванну: теплые воды омывали грудь, лизали мочки ушей. После того как рана была тщательно промыта и обработана, он взял курс на восток. Сделал три мили вниз по течению реки Вена - едва различимая, она бежала по бетонному руслу и исчезала под Нашмаркт. Проследовал мимо Оперы, по запруженной толпой Кернтнерштрассе. Заказал чашку кофе и рогалик в том самом кафе, где он познакомился с Абигайль. В три часа он позвонил Графине. Она сообщила, что слишком измучена и издергана для очной ставки. Сэмюэл С. сказал, что он может перезвонить в это же самое время. В будущем году. Церковный колокол пробил четыре, он сел в 71-й трамвай, который закружил по улицам, названным в честь философов.",
            lat: "48.2036064",
            lon: "16.3703464",
            order: "6"
          },
          {
            name: "Улица Гольдеггассе",
            description:
              'Сэмюэл С. стоял у закрытых дубовых дверей подъезда герра Доктора. Кепка плотно сидит на голове этим августовским вечером, без пяти шесть, в четверг, в Вене. Можно спуститься по Гольдеггассе, чувствуя, что тебя только что отделали. Именно здесь, к востоку от Мюнхена, Парижа и Галифакса (Новая Шотландия). Спокойным, размашистым шагом - по улочкам, прилегающим к Св.Стефану: его большой колокол как раз бьет шесть. На углах по всей Кернтнерштрассе ранние "уличные пташки" уже занимают свои позиции. Бледно-голубые и розовые хлопчатобумажные платья, на плечи наброшены свитера - вечером работать прохладно. Сэмюэл С. сворачивает в узкий серый переулок, заходит в какое-то подобие мавзолея, отделанного дымчато-желтым мрамором. Уселся в отдельную кабинку, положил руки на столик, уткнулся лбом в запястье. Официантка наклоняется к его унылой фигуре.',
            lat: "48.1897653",
            lon: "16.3770526",
            order: "7"
          },
          {
            name: "Улица Кернтнерштрассе",
            description:
              'Сэмюэл С. стоял у закрытых дубовых дверей подъезда герра Доктора. Кепка плотно сидит на голове этим августовским вечером, без пяти шесть, в четверг, в Вене. Можно спуститься по Гольдеггассе, чувствуя, что тебя только что отделали. Именно здесь, к востоку от Мюнхена, Парижа и Галифакса (Новая Шотландия). Спокойным, размашистым шагом - по улочкам, прилегающим к Св.Стефану: его большой колокол как раз бьет шесть. На углах по всей Кернтнерштрассе ранние "уличные пташки" уже занимают свои позиции. Бледно-голубые и розовые хлопчатобумажные платья, на плечи наброшены свитера - вечером работать прохладно. Сэмюэл С. сворачивает в узкий серый переулок, заходит в какое-то подобие мавзолея, отделанного дымчато-желтым мрамором. Уселся в отдельную кабинку, положил руки на столик, уткнулся лбом в запястье. Официантка наклоняется к его унылой фигуре.',
            lat: "48.204464",
            lon: "16.370639",
            order: "8"
          },
          {
            name: "Собор Святого Стефана",
            description:
              'Сэмюэл С. стоял у закрытых дубовых дверей подъезда герра Доктора. Кепка плотно сидит на голове этим августовским вечером, без пяти шесть, в четверг, в Вене. Можно спуститься по Гольдеггассе, чувствуя, что тебя только что отделали. Именно здесь, к востоку от Мюнхена, Парижа и Галифакса (Новая Шотландия). Спокойным, размашистым шагом - по улочкам, прилегающим к Св.Стефану: его большой колокол как раз бьет шесть. На углах по всей Кернтнерштрассе ранние "уличные пташки" уже занимают свои позиции. Бледно-голубые и розовые хлопчатобумажные платья, на плечи наброшены свитера - вечером работать прохладно. Сэмюэл С. сворачивает в узкий серый переулок, заходит в какое-то подобие мавзолея, отделанного дымчато-желтым мрамором. Уселся в отдельную кабинку, положил руки на столик, уткнулся лбом в запястье. Официантка наклоняется к его унылой фигуре.',
            lat: "48.208429",
            lon: "16.373460",
            order: "9"
          }
        ]
      }
    ]
  },
  {
    book: {
      description:
        "Псевдоавтобиографическая постмодернистская поэма написана в 1969—1970 году и распространялась в самиздате. Впервые была опубликована летом 1973 года в Израиле в журнале «АМИ», вышедшем тиражом в 300 экземпляров; затем — в 1977 году в Париже. Поэма «Москва — Петушки» переведена на многие языки, по ней поставлены многочисленные спектакли.",
      cover:
        "https://upload.wikimedia.org/wikipedia/ru/thumb/7/73/Moscow_Petushki.jpg/200px-Moscow_Petushki.jpg",
      title: "Москва — Петушки",
      isbn: "978-5-389-03119-7"
    },
    authors: [
      {
        avatar:
          "https://upload.wikimedia.org/wikipedia/ru/thumb/f/f2/ErofeevV.jpg/200px-ErofeevV.jpg",
        name: "Венедикт Васильевич Ерофеев"
      }
    ],
    routes: [
      {
        name: "Route10",
        path: [
          {
            name: "Point1",
            description: "Description text 4567",
            lat: "11.98",
            lon: "-21.543",
            order: "1"
          },
          {
            name: "Point2",
            description: "Description text 654",
            lat: "110.5",
            lon: "-210.23",
            order: "2"
          }
        ]
      }
    ]
  },
  {
    book: {
      description:
        "Tempor duis ut esse non culpa sunt excepteur. Consequat ipsum ipsum cillum culpa" +
        " officia incididunt nostrud incididunt anim duis et. Consequat ad magna nulla id" +
        " pariatur excepteur velit dolore ex labore ex non nostrud. Velit do ad fugiat ul" +
        "lamco adipisicing eiusmod non cupidatat proident enim. Nisi non elit cillum do e" +
        "lit sunt tempor irure anim non duis. Ea magna ipsum adipisicing consequat velit " +
        "non labore in aliqua quis. Labore occaecat incididunt quis sit nostrud ut et sun" +
        "t et ullamco consequat eiusmod aliquip aute.",
      cover: "http://placehold.it/200x320",
      title: "dolor Lorem",
      isbn: "3a804ac5-e1d1-4a07-923e-682043a9baca"
    },
    authors: [
      {
        avatar: "http://placehold.it/100x140",
        name: "perwasty ohlet"
      },
      {
        avatar: "http://placehold.it/100x140",
        name: "gatru fontate"
      }
    ],
    routes: [
      {
        name: "Route23",
        path: [
          {
            name: "Point15",
            description: "Description text 678",
            lat: "15",
            lon: "62",
            order: "1"
          },
          {
            name: "Point26",
            description: "Description text 453",
            lat: "15",
            lon: "70",
            order: "2"
          }
        ]
      }
    ]
  }
];

const createBook = (knex, book) => {
  return knex("books").insert(book, "id");
};
const selectAuthor = (knex, author) => {
  return knex("authors")
    .where({ name: author.name })
    .select("id");
};
const createAuthor = (knex, author) => {
  return knex("authors")
    .insert(author, "id")
    .catch(function() {
      return selectAuthor(knex, author);
    });
};
const createBookAuthor = (knex, bookId, authorId) => {
  return knex("authors_books").insert({
    book_id: bookId,
    author_id: authorId
  });
};
const createAuthors = (knex, Promise, authors) => {
  let promises = [];

  authors.forEach(author => {
    promises.push(createAuthor(knex, author));
  });
  return Promise.all(promises);
};

const createRoute = (knex, Promise, bookId, route) => {
  return knex("routes")
    .insert({ name: route.name, book_id: bookId }, "id")
    .then(routeId => {
      let promises = [];
      route.path.forEach(point => {
        promises.push(createPoint(knex, routeId[0], point));
      });
      return Promise.all(promises);
    });
};

const createPoint = (knex, routeId, point) => {
  return knex("points").insert(
    {
      name: point.name,
      route_id: routeId,
      order: parseInt(point.order),
      point: knex.raw(`Point(${point.lon}, ${point.lat})`),
      description: point.description
    },
    "id"
  );
};

const createBooks = (knex, Promise, bookData) => {
  return Promise.all([
    createBook(knex, bookData.book),
    createAuthors(knex, Promise, bookData.authors)
  ])
    .then(ids => {
      let promises = [];
      ids[1].forEach(authorId => {
        let authorIdVal =
          typeof authorId[0] === "object" && authorId[0].hasOwnProperty("id")
            ? authorId[0].id
            : authorId[0];
        promises.push(createBookAuthor(knex, ids[0][0], authorIdVal));
      });
      return [ids[0][0], Promise.all(promises)];
    })
    .then(data => {
      let promises = [];
      bookData.routes.forEach(route => {
        promises.push(createRoute(knex, Promise, data[0], route));
      });
      return Promise.all(promises);
    });
};

exports.seed = (knex, Promise) => {
  return knex("authors_books")
    .del()
    .then(() => knex("books").del())
    .then(() => knex("authors").del())
    .then(() => {
      let promises = [];

      booksData.forEach(bookData => {
        promises.push(createBooks(knex, Promise, bookData));
      });

      return Promise.all(promises);
    });
};
